In [10]:
import pandas as pd

In [11]:

friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

   age        job   name
0   20    student   Jone
1   30  developer  Jenny
2   30    teacher   Nate

In [12]:
df2=df.drop('age', axis=1)

In [13]:
df2

         job   name
0    student   Jone
1  developer  Jenny
2    teacher   Nate

In [14]:
df3=df.drop('age', axis=0)

ValueError: labels ['age'] not contained in axis

In [15]:
df['salary'] = 0

In [16]:
df

   age        job   name  salary
0   20    student   Jone       0
1   30  developer  Jenny       0
2   30    teacher   Nate       0

In [17]:
import numpy as np
df['salary'] = np.where(df['job'] != 'student' , 'yes', 'no')

In [18]:
df

   age        job   name salary
0   20    student   Jone     no
1   30  developer  Jenny    yes
2   30    teacher   Nate    yes

In [19]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [20]:
df['total'] = df['midterm'] + df['final']

In [21]:
df

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       10     30     40

In [22]:
df['average'] = df['total'] / 2

In [23]:
df

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       10     30     40     20.0

In [24]:
grades = []

for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    elif row >= 70:
        grades.append('C')
    else:
        grades.append('F')
        
df['grade'] = grades

In [25]:
df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       10     30     40     20.0     F

In [26]:
def pass_or_fail(row):
    print(row)
    if row != "F":
        return 'Pass'
    else:
        return 'Fail'

In [27]:
df.grade = df.grade.apply(pass_or_fail)

A
B
F

In [28]:
df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       10     30     40     20.0  Fail

In [29]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [30]:
def extract_year(row):
    return row.split('-')[0]

In [31]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [32]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [33]:
df.drop('yyyy-mm-dd', axis=1)

   year
0  2000
1  2002
2  2005

In [34]:
def extract_year(year, current_year):
    return current_year - int(year)

In [35]:
df['age'] = df['year'].apply(extract_year, current_year=2018)

In [36]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   18
1  2002-09-24  2002   16
2  2005-12-20  2005   13

In [42]:
def get_introduce(age):
    return ("I am " + str(age) + " years old.")

In [43]:
df['introduce'] = df['age'].apply(get_introduce)

In [44]:
df

   yyyy-mm-dd  year  age           introduce
0  2000-06-27  2000   18  I am 18 years old.
1  2002-09-24  2002   16  I am 16 years old.
2  2005-12-20  2005   13  I am 13 years old.

In [45]:

def get_introduce2(row):
    return "I was born in "+str(row.year)+" my age is "+str(row.age)
df.introduce = df.apply(get_introduce2, axis=1)

df

   yyyy-mm-dd  year  age                        introduce
0  2000-06-27  2000   18  I was born in 2000 my age is 18
1  2002-09-24  2002   16  I was born in 2002 my age is 16
2  2005-12-20  2005   13  I was born in 2005 my age is 13

In [46]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [47]:
job_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [48]:
df.job = df.job.map({"student":1,"developer":2,"teacher":3})
df

   age  job
0   20    1
1   30    2
2   30    3

In [49]:

x_y = [{'x': 5.5, 'y': -5.6},
         {'x': -5.2, 'y': 5.5},
         {'x': -1.6, 'y': -4.5}]
df = pd.DataFrame(x_y)
df

     x    y
0  5.5 -5.6
1 -5.2  5.5
2 -1.6 -4.5

In [50]:
df = df.applymap(np.around)
df

     x    y
0  6.0 -6.0
1 -5.0  6.0
2 -2.0 -4.0

In [52]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list)
df

   final  midterm   name
0     85       95   John
1     80       85  Jenny
2     30       10   Nate

In [53]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list)
df

   final  midterm   name
0     85       95   John
1     80       85  Jenny
2     30       10   Nate

In [54]:
df2 = pd.DataFrame([['Ben', 50,50]])

In [55]:
df2

     0   1   2
0  Ben  50  50

In [56]:
df.append(df2, ignore_index=True)

   final  midterm   name    0     1     2
0   85.0     95.0   John  NaN   NaN   NaN
1   80.0     85.0  Jenny  NaN   NaN   NaN
2   30.0     10.0   Nate  NaN   NaN   NaN
3    NaN      NaN    NaN  Ben  50.0  50.0

In [57]:
df

   final  midterm   name
0     85       95   John
1     80       85  Jenny
2     30       10   Nate

In [58]:
df2 = pd.DataFrame([['Ben', 50,50]], columns = ['name', 'midterm', 'final'])

In [59]:
df.append(df2, ignore_index=True)

   final  midterm   name
0     85       95   John
1     80       85  Jenny
2     30       10   Nate
3     50       50    Ben

In [65]:
df=df[['name', 'midterm', 'final']]

In [63]:
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [68]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [69]:
groupby_major = df.groupby('major')

In [70]:
groupby_major.groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

In [71]:
for name, group in groupby_major:
    print(name + ": " + str(len(group)))
    print(group)
    print()

Computer Science: 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics: 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics: 1
      name    major   sex
2  Abraham  Physics  male

Psychology: 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female